app/views/static_pages/meet.html.erb

									<h4>Ahmed Etefy</h4>
									<%user8 = User.find(5)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]