app/views/comments/show.html.erb

SELECT "cocs".* FROM "cocs" WHERE (comment_id=1)
---

<% @result = Coc.where("comment_id=#{@comment.id}")  %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
		<br>
		<% @user = User.where("id=#{res.user_id}") %>