app/views/tags/show.html.erb

  <ul class="blog_category">
  <% @tag.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "posts"."id" = "taggings"."post_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 2]]