app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "signaturs".* FROM "signaturs" WHERE "signaturs"."user_id" = ? LIMIT 1  [["user_id", 3]]
---
                                        <%userid = post.user_id %>
                                        <% @user = User.where("id=#{userid}") %>
                                            <span><i class="fa fa-user"></i> By: <%= @user.first.email%> </span>
                                          <% @sig = @user.first.signatur %>

SELECT "tags".* FROM "tags"
---
                                <ul class="blog_category">
                                	<% @tags = Tag.all %>