app/views/posts/show.html.erb

                                        <%userid = @post.user_id %>
                                        <% @user = User.where("id=#{userid}") %>
                                            <span><i class="fa fa-user"></i> By: <%= @user.first.email%> </span>
                                          <% @sig = @user.first.signatur %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "signaturs".* FROM "signaturs" WHERE "signaturs"."user_id" = ? LIMIT 1  [["user_id", 3]]

                                    <div class="post-tags">
                                        <strong>Categories:</strong>  <% @post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = ?  [["post_id", 1]]


                        <% @result = Comment.where("post_id=#{@post.id}")  %>
---
SELECT "comments".* FROM "comments" WHERE (post_id=1)