app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "d"], ["post_id", 1], ["user_id", 3], ["created_at", "2015-02-22 21:40:52.898907"], ["updated_at", "2015-02-22 21:40:52.898907"]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.post_id = params[:post_id]
		@comment.user_id = current_user.id
		@comment.save