app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id
		@post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hi"], ["body", "jbskjbd,wed"], ["user_id", 3], ["created_at", "2015-02-22 21:40:46.752337"], ["updated_at", "2015-02-22 21:40:46.752337"]]