app/controllers/signaturs_controller.rb

	def create

	@signatur = Signatur.new
  	if !params[:output].nil?
  	@signatur.image = addSignature(params[:output])
	end
	@signatur.user_id = current_user.id
	@signatur.save
	  @user = User.find(current_user.id)
---
INSERT INTO "signaturs" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]