app/controllers/tags_controller.rb

SELECT "posts".* FROM "posts" INNER JOIN "taggings" ON "taggings"."post_id" = "posts"."id" WHERE "taggings"."tag_id" = 2 GROUP BY posts.id HAVING count(taggings.id) = 1
---
	def show2

		tag_ids = params[:tags_ids]
		if (tag_ids!= nil)

		@result = Post.joins(:taggings).where(taggings: {tag: tag_ids}).group('posts.id').having("count(taggings.id) = #{tag_ids.length}")